---
kind: type
id: T:Autodesk.Revit.UI.IFCExternalServiceUIData
source: html/bbd91fea-754e-fb79-4383-dcb3ef22efac.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData

UI data wrapper for IFCExternalServiceUIData.

## Syntax (C#)
```csharp
public class IFCExternalServiceUIData : IDisposable
```